In [1]:
import pandas
x = pandas.Series(
    data = ['a', True, 3],
    index = ['first', 'second', 'third']
)

In [2]:
x[1]

True

In [3]:
x['second']

True

In [4]:
x[1:3]

second    True
third        3
dtype: object

In [6]:
x[[2, 0, 1]]

third        3
first        a
second    True
dtype: object

In [7]:
'first' in x

True

In [8]:
'first' in x.index

True

In [9]:
'2' in x.values

False

In [10]:
x.isin([True, 'a'])

first      True
second     True
third     False
dtype: bool

In [11]:
ns = pandas.Series(['2'])
x.append(ns)

first        a
second    True
third        3
0            2
dtype: object

In [12]:
x

first        a
second    True
third        3
dtype: object

In [13]:
x = x.append(ns)

In [14]:
x

first        a
second    True
third        3
0            2
dtype: object

In [15]:
x['first'] = '入门篇'

In [16]:
x[['second', 'third']] = ['工具篇', 'Python篇']
x

first         入门篇
second        工具篇
third     Python篇
0               2
dtype: object

In [23]:
x = x.drop(0)
x = x.drop('first')

In [24]:
x

second        工具篇
third     Python篇
dtype: object

In [29]:
import pandas
dataFrame = pandas.DataFrame(
    data = {
        'age': [21, 22, 23],
        'name' : ['KEN', 'John', 'JIMI']
    },
    index = ['first', 'second', 'third'],
    columns = ['name', 'age']
)
dataFrame

        name  age
first    KEN   21
second  John   22
third   JIMI   23

In [31]:
dataFrame[['name', 'age']]

        name  age
first    KEN   21
second  John   22
third   JIMI   23

In [32]:
dataFrame.iloc[2]

name    JIMI
age       23
Name: third, dtype: object

In [34]:
dataFrame.iloc[0:2]

        name  age
first    KEN   21
second  John   22

In [49]:
nDataFrame = pandas.DataFrame(
    data = {
        'age' : [24, 25, 26],
        'name' : ['Mike', 'Nick', 'Lining']
    }
)
#dataFrame = dataFrame.drop([1, 2], axis = 0)
dataFrame = dataFrame.append(nDataFrame)
dataFrame

          name  age
first      KEN   21
second    John   22
third     JIMI   23
0         Mike   24
1         Nick   25
2       Lining   26

In [50]:
dataFrame['class'] = [1, 2, 3, 4, 5, 6]
dataFrame

          name  age  class
first      KEN   21      1
second    John   22      2
third     JIMI   23      3
0         Mike   24      4
1         Nick   25      5
2       Lining   26      6

In [51]:
dataFrame.columns

Index(['name', 'age', 'class'], dtype='object')

In [52]:
dataFrame.columns = ['Name', 'Age', 'Class']

In [53]:
dataFrame

          Name  Age  Class
first      KEN   21      1
second    John   22      2
third     JIMI   23      3
0         Mike   24      4
1         Nick   25      5
2       Lining   26      6

In [54]:
dataFrame.index

Index(['first', 'second', 'third', 0, 1, 2], dtype='object')

In [55]:
dataFrame.index = ['first', 'second', 'third', 'four', 'five', 'six']
dataFrame

          Name  Age  Class
first      KEN   21      1
second    John   22      2
third     JIMI   23      3
four      Mike   24      4
five      Nick   25      5
six     Lining   26      6

In [56]:
dataFrame.at['four', 'Name']

'Mike'

In [57]:
dataFrame.at['four', 'Name'] = 'Mikes'
dataFrame

          Name  Age  Class
first      KEN   21      1
second    John   22      2
third     JIMI   23      3
four     Mikes   24      4
five      Nick   25      5
six     Lining   26      6

In [58]:
# axis = 1 代表列 axis = 0 代表行
dataFrame.drop('Class', axis = 1)

          Name  Age
first      KEN   21
second    John   22
third     JIMI   23
four     Mikes   24
five      Nick   25
six     Lining   26

In [59]:
# axis = 1 代表列 axis = 0 代表行
dataFrame.drop('first', axis = 0)

          Name  Age  Class
second    John   22      2
third     JIMI   23      3
four     Mikes   24      4
five      Nick   25      5
six     Lining   26      6